Giesekus/dilutedSolution/zo=0.1mm_f=3.69Hz/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

runApplication $application

runApplication postProcess -func sampleDict
